// Написать программу, которая из имеющегося массива строк формирует массив из строк, 
// длинна которых меньше либо равна 3 символа. Первоначальный массив можно ввести с клавиатуры с клавиатуры, либо задать на старте 
// выполнение алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами 


// Примеры: 
// ["hello", "2", "woorld",":-)"] -> ["2", ":-)"]

using System; 
using static System.Console; 

Write ("Введите элементы массива через через пробел: ");
//Write ("Введите число символов, не менее: "); 
//int count = int.Parse(ReadLine()); 
//string [] array = new string [count];
string array = ReadLine(); 

string [] FindEllement (string [] array){
    if {

    }
    return array;
}